
JEECG简介：
JEECG（J2EE Code Generation） 是一款基于代码生成器的智能开发平台，代码生成 + Online Coding在线开发， 可以帮助解决Java项目80%的重复工作，让开发更多关注业务逻辑。既能快速提高开发效率，帮助公司节省人力成本，同时又不失扩展性和灵活性。 


技术架构：
        采用SpringMVC+Hibernate+Spring jdbc+UI组件基础架构，采用面向声明的开发模式，基于泛型方式编写极少代码即可实现复杂的数据展示、数据编辑、表单处理等功能，再配合代码生成器的使用将JavaEE的开发效率提高6倍以上，可以将代码减少80%以上。 
技术点一：代码生成器，支持多种数据模型,根据表生成对应的Entity,Service,Dao,Action,JSP等,增删改查功能生成直接使用
技术点二：UI快速开发库，针对WEB UI进行标准式封装，页面统一采用自定义标签实现功能：列表数据展现、页面校验等,标签使用简单清晰且便于维护
技术点三：Online Coding开发【新增】，开发模式由代码生成器转变为Online Coding模式
                    (通过在线配置实现一个表模型的增删改查功能，无需一行代码，支持用户自定义表单)

JEECG二次开发平台适用范围：
  JEECG智能开发平台，可以应用在任何J2EE项目的开发中，尤其适合企业信息管理系统（MIS）、内部办公系统（OA）、企业资源计划系统（ERP）、客户关系管理系统（CRM）等，其半智能手工Merge的开发方式，可以显著提高开发效率40%以上，极大降低开发成本。


JEECG 3.3.1 beta升级日志： 

———————————————————————————————————————— 
version: jeecg-framework-3.3.1.beta 
date:     2013-08-04 
作者:     张代浩
联系邮箱: scott@jeecg.com
———————————————————————————————————————— 
1. Bootstrap首页风格
2. Online Coding开发模式（无需编码，通过配置实现表单增删改查功能）
3. 动态报表配置（用户配置一个SQL，即可生成一个数据列表）
4. 支持多级菜单
5. 字典表维护方式修改（提高效率）
6. 非标签的按钮权限控制
7. 多附件上传例子
8. 查询过滤器支持区间查询
9. 代码生成器增加sqlserver支持
10. 在线用户显示功能
11. 乐观锁示例
12. Springjdbc sql分离写法例子
13. 标签增加扩展属性
14. 数据列表字典字段，自动根据字典进行文本显示
15. 数据列表批量操作示例
16. 平台数据自动初始化功能
17. 在线word编辑
18. popup示例
19. 不使用UI标签的[单表][一对多表]的例子
20. 修复bug: 超过4个二级菜单，上级菜单消失
21. 修复bug: 图标样式生成问题




JEECG  开发模式[Online Coding]介绍： 

———————————————————————————————————————— 
Title:  Online Coding模式 
date:     2013-08-04 
架构设计:    张代浩
核心开发成员：周俊峰(架构师)、赵俊夫、屈然博
联系邮箱: scott@jeecg.com
————————————————————————————————————————  

JEECG开发模式由代码生成器转变为Online Coding模式
                    (通过在线配置实现一个表模型的增删改查功能，无需一行代码，支持用户自定义表单)

Online Coding模式的优势： 
   A.不再采用代码生成的方式，支持用户在线开发，通过配置即可完成一个表模型的增删改查功能，
      支持二次开发，可扩展对应的JS增强接口和SQL增强接口;
   B.页面表单展示样式两种方式  
       方式一：默认系统风格(系统默认生成)
       方式二：用户自定义表单布局(通过Word设计表单布局，进行模板上传) 
   C.不需要写代码，配置即可生成功能 
   D.避免代码生成方式，过多冗余代码
   E.避免系统随着时间推移越来越大，难维护的问题
   F.支持单表模型，一对多数据模型配置生成
   E.动态报表配置(用户配置一个SQL，即可生成一个报表)


JEECG 后续版本发布说明:

———————————————————————————————————————— 
    JEECG 从3.3.1开始底层核心功能模块,采用组件方式发布,组件目前划分以下内容：
    [1].代码生成器组件    (负责人:待定,    架构师:张代浩)
    [2].Online Coding组件 (负责人:周俊峰,  架构师:张代浩)
    [3].动态报表组件      (负责人:待定,    架构师:张代浩)
    [4].UI标签库组件      (负责人:赵俊夫,  架构师:张代浩)
    [5].工作流组件        (负责人:待定,    架构师:张代浩)
————————————————————————————————————————     



演示地址：http://demo.jeecg.org:8090/
Google代码地址：http://code.google.com/p/jeecg/downloads/list
JEECG技术论坛：http://www.jeecg.org/
技术交流：
   JEECG 技术群一: 106259349(已满)
   JEECG 技术群二: 106838471
   JEECG 技术群三: 289782002
